micropython/micropython/ports/esp32/boards/WAVESHARE_S3_ZERO/mpconfigboard.h
#ifndef MICROPY_HW_BOARD_NAME
// Can be set by mpconfigboard.cmake.
#define MICROPY_HW_BOARD_NAME               "ESP32-S3-Zero module"
#endif
#define MICROPY_HW_MCU_NAME                 "ESP32S3"